Refactoring DDD Pattern for Unit Test & Update Documentation version to 1.1.1
